In [1]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
from pandas import DataFrame, Series

In [2]:
s1 = Series(['a','b','c','d'])
s1

0    a
1    b
2    c
3    d
dtype: object

In [3]:
s2 = Series([10, 14, 13, 25, 8])
s2

0    10
1    14
2    13
3    25
4     8
dtype: int64

In [4]:
s3 = Series(['23', '5', '4'])
s3

0    23
1     5
2     4
dtype: object

In [5]:
df0 = DataFrame([s1, s2, s3])
df0

    0   1   2    3    4
0   a   b   c    d  NaN
1  10  14  13   25  8.0
2  23   5   4  NaN  NaN

In [6]:
df = DataFrame({0:s1, 1:s2, 2:s3})
df

     0   1    2
0    a  10   23
1    b  14    5
2    c  13    4
3    d  25  NaN
4  NaN   8  NaN

In [7]:
df1 = df.drop(2)
df1

     0   1    2
0    a  10   23
1    b  14    5
3    d  25  NaN
4  NaN   8  NaN

In [8]:
df.dropna()

   0   1   2
0  a  10  23
1  b  14   5
2  c  13   4

In [9]:
df2 = df.drop(2, axis=1)
df2

     0   1
0    a  10
1    b  14
2    c  13
3    d  25
4  NaN   8

In [10]:
df.where(df[0]!='c')

     0     1    2
0    a  10.0   23
1    b  14.0    5
2  NaN   NaN  NaN
3    d  25.0  NaN
4  NaN   8.0  NaN

In [11]:
df.drop(np.where(np.array(df[0])=='c')[0])

     0   1    2
0    a  10   23
1    b  14    5
3    d  25  NaN
4  NaN   8  NaN

In [12]:
df[df[0]!='c']

     0   1    2
0    a  10   23
1    b  14    5
3    d  25  NaN
4  NaN   8  NaN

In [13]:
df.iloc[1,2]=7
df

     0   1    2
0    a  10   23
1    b  14    7
2    c  13    4
3    d  25  NaN
4  NaN   8  NaN

In [14]:
df.iloc[4,0]='e'

In [15]:
df

   0   1    2
0  a  10   23
1  b  14    7
2  c  13    4
3  d  25  NaN
4  e   8  NaN